// ==================== БАЗА БЛЮД ====================

const DISH_DATABASE = [
    { cat: "bar", name: "Овощной смузи", price: 77, sat: 9, mood: 5, recipe: { "овощи": 1 }, craft: "1 Овощи + Вода ➜ Смешать [Венчиком]" },
    { cat: "bar", name: "Фруктовый смузи", price: 100, sat: 6, mood: 12, recipe: { "фрукты": 1 }, craft: "1 Фрукты + Вода ➜ Смешать [Венчиком]" },
    { cat: "fastfood", name: "Тако с Мясо/дичью", price: 980, sat: 35, mood: 25, recipe: { "хлеб": 1, "мясной_фарш": 1, "сыр": 1, "овощи": 1 }, craft: "Лепёшка + Фарш + Сыр + Овощи" },
    { cat: "fastfood", name: "Буррито", price: 1043, sat: 40, mood: 30, recipe: { "хлеб": 1, "мясной_фарш": 1, "сыр": 1, "овощи": 1, "рис": 1 }, craft: "Лепёшка + Фарш + Сыр + Овощи + Рис" },
    { cat: "meat", name: "Стейк с фруктовым соусом и рисом", price: 903, sat: 50, mood: 35, recipe: { "стейк_заг": 1, "вареный_рис": 1 }, craft: "Стейк заготовка + Вареный рис" },
    { cat: "meat", name: "Стейк с фруктовым соусом и пюре", price: 1071, sat: 55, mood: 40, recipe: { "стейк_заг": 1, "картофельное_пюре": 1 }, craft: "Стейк заготовка + Картофельное пюре" }
];

window.DISH_DATABASE = DISH_DATABASE;
